In [2]:
import pandas

In [3]:
df2 = pandas.DataFrame([("Ravi", 100), ("Abhay", 200), ("Mava", 300), ("Kavi", 400)], columns=["Name", "Amount"])

In [4]:
df2.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
df2.index = ['a', 'b', 'c', 'd']

In [6]:
df2

    Name  Amount
a   Ravi     100
b  Abhay     200
c   Mava     300
d   Kavi     400

In [14]:
data1 = df2['Name']
print(data1, type(data1))

data2 = df2[['Name']]
print(data2, type(data2))

a     Ravi
b    Abhay
c     Mava
d     Kavi
Name: Name, dtype: object <class 'pandas.core.series.Series'>
    Name
a   Ravi
b  Abhay
c   Mava
d   Kavi <class 'pandas.core.frame.DataFrame'>

In [7]:
df2.loc['a'] 
df2.loc['b']# Latest wala lata hai for the output
# df2.loc['c']

Name      Abhay
Amount      200
Name: b, dtype: object

In [8]:
df2.loc['a':'b',:]

    Name  Amount
a   Ravi     100
b  Abhay     200

In [9]:
df2.loc['a':'B',:] #agar small letters me row ka naam likha hai to agla wala bhi small letters me likhayega.

Empty DataFrame
Columns: [Name, Amount]
Index: []

In [10]:
df2.loc['a','Name'] #syntax: df2.loc[row, column]

'Ravi'

In [11]:
df2.loc['a':'b','Name'] # 'a' to 'b' tak ke sare name column ke values

a     Ravi
b    Abhay
Name: Name, dtype: object

In [12]:
df2.loc['a', 'Name':'Amount'] # 'a' row ke sare columns ke values

Name      Ravi
Amount     100
Name: a, dtype: object

In [13]:
df2.loc['a':'b', 'Name':'Amount'] # 'a' to 'b' tak ke sare rows ke sare columns ke values

    Name  Amount
a   Ravi     100
b  Abhay     200

In [14]:
# BOOLEAN INDEXING

df2.loc[[True, False, True, False]] # True wale rows ke sare columns ke values

   Name  Amount
a  Ravi     100
c  Mava     300

In [15]:
df2.loc[[True, False, True, False], [False, True]] # True wale rows ke 'Amount' column ke values

   Amount
a     100
c     300

In [16]:
df2.loc[df2['Amount']>200] # Amount column me 200 se jyada wale rows ke sare columns ke values

   Name  Amount
c  Mava     300
d  Kavi     400

In [23]:
df2.loc[(df2['Amount']>200) & (df2['Amount']<400), [False, True]] # Amount column me 200 se jyada aur 400 se kam wale rows ke sare columns ke values

   Name  Amount
c  Mava     300

In [25]:
#ITERATION OVER THE DATAFRAME

for i in df2:
    print(i)

Name
Amount

In [27]:
len(df2) # Total number of rows

4

In [28]:
#How to find the total number of columns in a dataframe
len(df2.columns)

2

In [41]:
for i in df2.iterrows(): # iterrows is a function which is used to iterate over the rows of the dataframe
    print(i[0], type(i[1])) # i[0] is the index of the row and i[1] is the data of the row
    # break # To stop the iteration after the first row i.e. Ravi 100

a <class 'pandas.core.series.Series'>
b <class 'pandas.core.series.Series'>
c <class 'pandas.core.series.Series'>
d <class 'pandas.core.series.Series'>